Revit 2027 API
StructuralConnectionHandler.CodeCheckingStatus Property
 Code checking status of the structural connection.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralConnectionCodeCheckingStatus CodeCheckingStatus { get; set; }
Public Property CodeCheckingStatus As StructuralConnectionCodeCheckingStatus
	Get
	Set
public:
property StructuralConnectionCodeCheckingStatus CodeCheckingStatus {
	StructuralConnectionCodeCheckingStatus get ();
	void set (StructuralConnectionCodeCheckingStatus value);
}
member CodeCheckingStatus : StructuralConnectionCodeCheckingStatus with get, set
Property Value
StructuralConnectionCodeCheckingStatus
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace